clear all
%導線の[A]計算
%Amperes ∝ areas

% https://www.jspf.or.jp/Journal/PDF_JSPF/jspf2007_02/jspf2007_02-169.pdf
% 式(9)から求めることにする。
% 電流密度に面積をかければ、電流が出てくる

k_B = 1.38*10^(-23);

%n_e：電子密度→はるあきさんの博論p.44　4×10^20 [m^-3]
%q：イオン電荷量
%T_e：電子温度→青山さんのp.35を参照 5~8[eV]
%静電プローブの人のを見れば良い
n_e = 4*10^20;
q = 1.60*10^(-19);
T_e = 10.0*q/k_B
T_i = T_e
%m_i：イオン質量
m_i = 1.672*10^(-27);


%T_e >> T_iと仮定した状態なら、C_s = sqrt(k_B*T_e/m_i)
C_s = sqrt((k_B*(T_e+T_i))/m_i) * 10^(-3)

%u_th：イオンの熱速度→はるあきさんの博論p.46　30 [km/s]
%u_d：早くてアルヴェン速度ぐらい→はるあきさんの博論p.46　50[km/s]
%u_d：イオンフロー速度（本来は、電子も入る）
u_th = 20*10^3;
u_d = 50;

%電流密度j_iの計算式 "+"の場合 
j_i = n_e*q*exp(-1/2)*C_s*exp((u_th+u_d)^2/C_s^2)
S = 1*10^(-3) * 5*10^(-3)
% S = 20E-3 * 1E-3;

Ii = j_i * S

%%
%以下コンデンサの話
%Q=CVとの比較
%I=100[mA], T=200E-6[s] 
I = Ii;
T = 200E-6;
Q1 = I * T

C = 22E-6;

%Q = C * V
Q2 = C * 40


%%
e = 1.602*10^(-19);                 %[C]
n_e = 10^(20);                      %[m^-3]
kTe = 10*1.602*10^(-19);            %[eV]-> [J]換算
mi_Ar = 6.6*10^(-23)*10^(-3);       %[kg]
mi_H = 1.0/((6.0*10^(23))*10^(3));  %[kg]
S = 4.0 * 10^(-6);                  %[m^(-2)]

I = 0.61 *e*n_e*sqrt(kTe/mi_H)*S

%%
r = 0.45;
h = 1.54;
S = pi*r^2+2*pi*r*h